11/data/attachments/cd6285dade850987.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Bryce_kitchen_Friend_52698_8</nif:username>
            <nif:friendToBeRequested>soap_friends_9f3692d2-b0b2-4737-bae9-628b470a21ee</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>